In [23]:
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
file = pd.read_csv(r"F:\DOCUMENTS\RISHIKA\Datasets\Datasets\homeprices.csv")
file.head()

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [17]:
f1=file.isnull()
f1

    area  bedrooms    age  price
0  False     False  False  False
1  False     False  False  False
2  False      True  False  False
3  False     False  False  False
4  False     False  False  False
5  False     False  False  False

In [18]:
f1.isnull().sum()

area        0
bedrooms    0
age         0
price       0
dtype: int64

In [10]:
file.bedrooms.median()

4.0

In [19]:
f1=file.fillna(file.bedrooms.median())

In [20]:
from sklearn.linear_model import LinearRegression

reg = LinearRegression()
reg.fit(f1[['area','bedrooms','age']],f1.price)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [21]:
reg.predict([[5600,4,6]])

array([923037.88960132])

In [22]:
reg.coef_ # m1 = 112 m2 = 23388 m3 = -3231

array([  112.06244194, 23388.88007794, -3231.71790863])

In [26]:
#plt.scatter(f1.area,f1.price)
#plt.plot(f1.area,reg.predict(f1[["area"]]))

In [28]:
file1 = pd.read_csv(r"F:\DOCUMENTS\RISHIKA\Datasets\Datasets\hirings.csv")
file1.head()

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000

In [31]:
file1.isnull().sum()

experience         2
test_score         1
interview_score    0
salary             0
dtype: int64

In [ ]:
file1.experience =